app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "yo"], ["body", "no me gusto el articulo"], ["article_id", 2], ["created_at", "2016-11-08 22:15:48.841557"], ["updated_at", "2016-11-08 22:15:48.841557"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)